tutorials/immersedBoundary/cylinderInChannelIcoIbFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          amgSolver;
        cycle           W-cycle;
        policy          PAMG;
        nPreSweeps      2;
        nPostSweeps     2;
        groupSize       4;
        minCoarseEqns   4;
        nMaxLevels      100;
        scale           on;
        smoother        symGaussSeidel;

        minIter         1;
        maxIter         100;
        tolerance       1e-7;
        relTol          0.01;
    }

    pFinal
    {
        solver          amgSolver;
        cycle           W-cycle;
        policy          PAMG;
        nPreSweeps      2;
        nPostSweeps     2;
        groupSize       4;
        minCoarseEqns   4;
        nMaxLevels      100;
        scale           on;
        smoother        symGaussSeidel;

        minIter         1;
        maxIter         100;
        tolerance       1e-7;
        relTol          0;
    }

    U
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        minIter          1;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 5;

    pRefPoint (0 -0.45 0.05);
    pRefValue 0;
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;

    pRefPoint (0 -0.45 0.05);
    pRefValue 0;
}


// ************************************************************************* //
